## DATA IMPORTING

In [1]:
import numpy as np
import pandas as pd

In [17]:
df1 = pd.read_csv('train.csv')
df2 = pd.read_csv('test.csv')
codf = pd.read_csv('US_COVID_data_state_level.csv')
cidf = pd.read_csv('city_details.csv')
wadf = pd.read_csv('warehouse_mapping.csv')

In [19]:
df1.tail(),df1.shape

(            date  wh_id  sales
 453210  12/03/21   97.0     84
 453211  13/03/21   97.0     60
 453212  14/03/21   97.0     81
 453213  15/03/21   97.0     90
 453214  16/03/21   97.0     48,
 (453215, 3))

In [6]:
corl = codf[codf.conf_cases.notna()]

In [7]:
a,b = corl.tot_cases,corl.conf_cases

In [8]:
a.corr(b)

0.994857188030104

In [15]:
cidf1 = cidf.drop(['zip_code','country','state_name'],axis = 1)
cidf1 = cidf1.drop_duplicates()
cidf1.tail(),cidf1.shape

(            city state
 554  WESTMINSTER    CA
 555      ONTARIO    CA
 556       TACOMA    WA
 557      BOZEMAN    MT
 558    CLACKAMAS    OR,
 (523, 2))

In [28]:
wadf

     wh_id                     warehouse_name         city
0        1                WAREHOUSE 1 SEATTLE      SEATTLE
1       10             WAREHOUSE 10 ANCHORAGE    ANCHORAGE
2     1000            WAREHOUSE 1000 COLUMBIA     COLUMBIA
3     1001              WAREHOUSE 1001 TUSTIN       TUSTIN
4      122         WAREHOUSE 122 TUSTIN RANCH       TUSTIN
..     ...                                ...          ...
554    943  WAREHOUSE 943 WESTMINSTER BUS CTR  WESTMINSTER
555    947      WAREHOUSE 947 ONTARIO BUS CTR      ONTARIO
556     95                WAREHOUSE 95 TACOMA       TACOMA
557     96               WAREHOUSE 96 BOZEMAN      BOZEMAN
558     97             WAREHOUSE 97 CLACKAMAS    CLACKAMAS

[559 rows x 3 columns]

In [11]:
m = codf.merge(cidf1,how = 'left',on='state')
m

            date state  tot_cases  conf_cases         city
0       22/01/20    OH          0         NaN       TOLEDO
1       22/01/20    OH          0         NaN       EASTON
2       22/01/20    OH          0         NaN  CENTERVILLE
3       22/01/20    OH          0         NaN   PERRYSBURG
4       22/01/20    OH          0         NaN       BOSTON
...          ...   ...        ...         ...          ...
261563  23/05/21    FL    2267144         NaN        DAVIE
261564  23/05/21    FL    2267144         NaN         PALM
261565  23/05/21    IA     370625         NaN   CORALVILLE
261566  23/05/21    IA     370625         NaN    DAVENPORT
261567  23/05/21    IA     370625         NaN         WEST

[261568 rows x 5 columns]

In [20]:
b = []
for row in wadf.values:
  b.append(row[1].split()[2])

wadf['city'] = np.array(b)

In [23]:
x = df1.merge(wadf.drop(axis = 1,columns=['warehouse_name']),how='left',on = 'wh_id')

In [29]:
x

            date  wh_id  sales       city
0       02/01/19    1.0     44    SEATTLE
1       03/01/19    1.0     48    SEATTLE
2       04/01/19    1.0     36    SEATTLE
3       05/01/19    1.0     40    SEATTLE
4       06/01/19    1.0     80    SEATTLE
...          ...    ...    ...        ...
453210  12/03/21   97.0     84  CLACKAMAS
453211  13/03/21   97.0     60  CLACKAMAS
453212  14/03/21   97.0     81  CLACKAMAS
453213  15/03/21   97.0     90  CLACKAMAS
453214  16/03/21   97.0     48  CLACKAMAS

[453215 rows x 4 columns]

In [30]:
z = x.merge(m,how='left', on = ['date','city'])

In [31]:
z[z.city == 'COLUMBIA']

            date   wh_id  sales      city state  tot_cases  conf_cases
1610    02/01/19  1000.0     88  COLUMBIA   NaN        NaN         NaN
1611    03/01/19  1000.0     76  COLUMBIA   NaN        NaN         NaN
1612    04/01/19  1000.0     72  COLUMBIA   NaN        NaN         NaN
1613    05/01/19  1000.0     68  COLUMBIA   NaN        NaN         NaN
1614    06/01/19  1000.0     80  COLUMBIA   NaN        NaN         NaN
...          ...     ...    ...       ...   ...        ...         ...
156305  14/03/21  1232.0    146  COLUMBIA    SC   539411.0    457536.0
156306  15/03/21  1232.0    141  COLUMBIA    MD   394716.0         NaN
156307  15/03/21  1232.0    141  COLUMBIA    SC   540011.0    457938.0
156308  16/03/21  1232.0    456  COLUMBIA    MD   395633.0         NaN
156309  16/03/21  1232.0    456  COLUMBIA    SC   541217.0    458734.0

[2450 rows x 7 columns]

In [ ]:
z[z.city == 'AURORA'].wh_id.unique()

array([106., 439.])

In [ ]:
codf.head()

       date state  tot_cases  conf_cases
0  22/01/20    OH          0         NaN
1  22/01/20    GA          0         NaN
2  22/01/20    OK          0         NaN
3  22/01/20    NM          0         NaN
4  22/01/20    HI          0         NaN

In [ ]:
codf['tot_cases']

In [ ]:
z[z.city == 'W'].wh_id.unique()

array([1030., 1167., 1262., 1294.,  205.,  364.,  630.,  684.])

In [ ]:
cidf[cidf.city == 'COLUMBIA']

         city  zip_code state      state_name country
2    COLUMBIA     21075    MD        MARYLAND      US
154  COLUMBIA     29210    SC  SOUTH CAROLINA      US

In [ ]:
y = x.merge(cidf,how='left',on = 'city')
train = y.merge(codf,how='left', on = ['date','state'])
df1[df1.date == '02/01/19']

## DATA PREPROCESSING

## EDA